pages/blog/09-Aug-2023.htm
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-02-11 Sun 23:11 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>09 Aug 2023 - Guestbook!</title>
<meta name="description" content="In the 1990's guestbooks were rad!" />
<meta name="generator" content="Org Mode" />
<link href="../../styles/main.css" rel="stylesheet" type="text/css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">09 Aug 2023 - Guestbook!</h1>
<p>
Another week, another news article! This will be another fairly short article, but I think a lot of articles here will be pretty short unless I have other things to talk about then just this site. Well, first thing first, the <a href="../../apps/guestbook/index.php">Guestbook</a> is up and working. You probably won&rsquo;t have a chance to see it, but there are already two entries! They were written by me though, just to test things. The reason you won&rsquo;t see them is they&rsquo;ll be deleted as soon as there are other entries in the guestbook. The functions of this little applet are finished and you can write your own entries now, so feel free to do so!
</p>
<div id="outline-container-org3c65782" class="outline-2">
<h2 id="org3c65782">More Linux stuff</h2>
<div class="outline-text-2" id="text-org3c65782">
<p>
Okay, I don&rsquo;t normally talk about this and probably won&rsquo;t talk about it much here, but there are a couple of things that are getting in the way of my recreating and exploring the vintage Internet experience. One of those things is a little experiment I am running on a Linux system I have kicking around. Its actually the system that runs this site (or ran it during testing if you are somehow reading this after the site is live). I am experimenting with Wayland and using Qtile as a Wayland Compositor. I spent far too much time the last couple of days working on getting Qtile configured. Fortunately that is mostly done. There are a couple of nitpicky things that I want to fix, but everything is functional. So far I like the new graphical environment and am using it to write this blog entry. I&rsquo;ll let you know if things change. The main reason for doing this was that Emacs/EXWM is a terrible window manager and I wanted to use the new protocol.
</p>
</div>
</div>
<div id="outline-container-org353d92e" class="outline-2">
<h2 id="org353d92e">Doctoral Dissertation</h2>
<div class="outline-text-2" id="text-org353d92e">
<p>
The other thing is that I am in a doctoral residency and preparing to propose a dissertation so I am doing a ton of research and writing. This, of course, takes a lot of my time. This is the priority, so that&rsquo;s why I&rsquo;m saying to get used to short blog articles at least during this residency. I do plan on updating the site weekly, but they may only be small updates for now.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2024-02-11 Sun 23:11</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.1 (<a href="https://orgmode.org">Org</a> mode 9.7)</p>
</div>
</body>
</html>